<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download FreeMind disk image, build a package and import it into munki.</string>
    <key>Identifier</key>
    <string>com.github.prochat.munki.freemind</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>FreeMind</string>
        <key>NAME</key>
        <string>FreeMind</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>FreeMind is a free mind mapping application written in Java. FreeMind is licensed under the GNU General Public License. It provides extensive export capabilities.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>FreeMind.org</string>
            <key>category</key>
            <string>Productivity</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prochat.pkg.freemind</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Processor</key>
	    <string>MunkiPkginfoMerger</string>
	</dict>
	<dict>
	 <key>Arguments</key>
	 <dict>
	     <key>pkg_path</key>
	     <string>%pkg_path%</string>
	     <key>repo_subdirectory</key>
	     <string>%MUNKI_REPO_SUBDIR%</string>
	 </dict>
	 <key>Processor</key>
	 <string>MunkiImporter</string>
	</dict>
    </array>
    </dict>
</plist>

