<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Aseba Studio is the programming environment for Thymio</string>
	<key>Identifier</key>
	<string>com.github.prochat.download.aseba</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.thymio.org/fr:macinstall</string>
		<key>NAME</key>
		<string>Aseba</string>
		<key>SEARCH_PATTERN_URL</key>
		<string>href="(?P&lt;url&gt;.*\.dmg.*)"</string>
		<key>SEARCH_PATTERN_VERSION</key>
		<string>Version (?P&lt;url2&gt;[\.0-9]*).*</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The prochat-recipes repository, which contains this recipe, is deprecated and will be archived soon (details: https://github.com/autopkg/prochat-recipes/issues/15).</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_URL%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_VERSION%</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
	</array>
</dict>
</plist>
