<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads LeJOS EV3 for OS X dmg from sourceforge.
By default downloads latest version</string>
	<key>Identifier</key>
	<string>com.github.prochat.download.LeJOS-EV3</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://sourceforge.net/projects/ev3.lejos.p/files/</string>
		<key>NAME</key>
		<string>LeJOS-EV3</string>
		<key>SEARCH_PATTERN_URL</key>
		<string>href="(?P&lt;url&gt;.*\.tar\.gz.*)"</string>
		<key>SEARCH_PATTERN_VERSION</key>
		<string>href=".*title="/(?P&lt;url2&gt;[\.0-9]*).*/.*\.tar\.gz.*"</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The prochat-recipes repository, which contains this recipe, is deprecated and will be archived soon (details: https://github.com/autopkg/prochat-recipes/issues/15).</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_URL%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tar.gz</string>
				<key>url</key>
				<string>https://sourceforge.net%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_VERSION%</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
